<!-- err -->
<template>
  <el-dialog title="用户服务协议"
             :visible.sync="dialogShow"
             width="60%"
             height="500px">
    <div class="dialogBox">
      <p class="title">春播云药库用户服务协议</p>
      <div>
        <p class="descrption">一、特别声明</p>
        <p class="content">（一）湖南春播云药库科技有限公司（以下称“云药库”或“我们”）同意按照本协议的规定及其不时发布的操作规则提供基于移动网络的春播云药库网站（以下称“春播云药库”）。为获得服务，春播云药库使用人（以下称“用户”或“您”）应当基于了解本协议全部内容，在独立思考的基础上认可、同意本协议的全部条款并按照页面上的提示完成全部的注册程序，请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。免除或者限制责任的条款将以粗体加下划线标识，您应重点阅读。用户在进行注册程序过程中点击/同意/ 按钮即表示用户完全接受本协议。如您对协议有任何疑问，可向春播云药库客服咨询，如果您不同意本协议的任意内容，或者无法准确理解本公司对条款的解释，您应立即停止注册程序包括但不限于不要进行后续操作、不要接受本协议，不使用本服务。</p>
        <p class="content">（二）为提高用户的使用感受和满意度，用户同意我们将基于用户的操作行为对用户数据进行调查研究和分析，从而进一步优化春播云药库的服务。</p>
      </div>
      <div>
        <p class="descrption">二、 服务内容及费用</p>
        <p class="content">（一）春播云药库的具体服务由云药库根据实际情况提供，例如在线学习、充值提现、采购信息服务等。我们保留变更、中断或终止部分或全部服务的权利。</p>
        <p class="content">（二）我们为春播云药库平台向您提供的服务付出了大量的成本，除我们明示的收费业务外，春播云药库向用户提供的服务目前是免费的。如未来春播云药库向您收取合理费用，春播云药库会采取合理途径并提前通过法定程序以本协议约定的有效方式通知您，确保您有充分选择的权利。对于收费业务，春播云药库会在用户使用之前给予用户明确的提示，只有用户根据提示确认其愿意支付相关费用，用户才能使用该等收费服务。如用户拒绝支付相关费用，则春播云药库有权不向用户提供该等收费服务。</p>
        <p class="content">（三）您理解并同意，春播云药库仅提供相关的技术服务，除此之外与相关服务有关的设备（如手机及其他与接入移动网有关的装置）及所需的费用（如为使用移动网而支付的手机费、电话费或上网费）均应由用户自行负担。</p>
        <p class="content">（四）采购服务为春播云药库仅为具备相关经营资质的单位用户与供应商之间的信息撮合，提供药品、医疗器械交易信息与交易服务，该等用户在春播云药库使用采购服务应当先仔细阅读及同意《采购功能补充协议》。《采购功能补充协议》为本协议的补充协议，与本协议不可分割且具有同等法律效力。如您使用采购服务，视为您同意上述补充协议。</p>
      </div>
      <div>
        <p class="descrption">三、使用规则</p>
        <p class="content">（一）用户在完成注册程序或以其他春播云药库允许的方式实际使用服务时，应当具备中华人民共和国法律规定的与用户行为相适应的民事行为能力，如用户代表一家公司或其他法律主体在春播云药库注册，则用户声明和保证已获得完整的授权、有权使该公司或该法律主体受本协议的约束。采购服务仅供具备相关经营资质的单位用户使用，任何无证单位或个人用户盗用他人名义、资质或伪造授权进行药品采购均属于违法行为，如您不具备前述主体资格或相应的授权，应承担因此导致的一切后果，且春播云药库有权终止向您提供服务并注销您的账户并公告处理结果，对于涉嫌违反法律法规、涉嫌违法犯罪的行为，春播云药库有权保存有关记录，并依法向有关主管行政部门报告、配合有关行政主管部门调查，并可能依法移送司法机关。</p>
        <p class="content">（二）用户使用手机号为账户注册春播云药库，该帐号和密码由用户负责保管，用户登录平台后的指令将视为用户所为，春播云药库任何时候均不会主动要求用户提供账户密码，用户应确保在每个上网时段结束时退出登录并以正确步骤离开春播云药库平台；用户请勿委托任何人员代为操作或登录、代下单、代支付、代还白条，更不要在线下将货款交付任何人员。用户应对账户项下的所有行为结果（包括但不限于在线签署各类协议、发布信息、询/报价、采购产品、订购服务及披露信息等）负责。因用户委托任何人员实施前述行为、主动泄露或因用户遭受他人攻击、诈骗等行为导致的损失及后果，将由用户自身承担责任，由用户通过司法、行政等救济途径向侵权行为人追偿。</p>
        <p class="content">（三）用户进行实名认证和获取终端码时，应提供真实、有效、合法的证件，如证件被查明作假，春播云药库有权冻结用户通过春播云药库获得的收益，封止和删除帐号。</p>
        <p class="content">（四）用户在使用春播云药库过程中，必须遵循以下原则：</p>
        <p class="content">1. 遵守中国有关的法律和法规（例如：所设置的账户登录名及昵称不得违反国家法律法规，否则春播云药库可回收您的登录名及昵称）；</p>
        <p class="content">2. 不得为任何非法目的或以任何非法方式而使用春播云药库（例如：证件造假、盗用他人账号、名义或资质）；</p>
        <p class="content">3. 除非法律法规另有规定，用户不得转让、出借、出租春播云药库账户、主动泄露密码或以任何方式供他人使用，否则我们有权追究用户的违约责任，且由此产生的相应责任均由用户承担；</p>
        <p class="content">4. 如用户发现任何非法使用帐号的情况，应立即通告春播云药库，我们会第一时间采取行动，但用户理解我们对用户的任何请求采取行动均需要合理时间，且应用户请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大，除我们存在法定过错外，我们不承担责任。</p>
      </div>
      <div>
        <p class="descrption">四、知识产权</p>
        <p class="content">春播云药库提供的服务内容可能包括：文字、声音、图片、图表等。所有这些内容均为云药库或授权云药库使用的合法权利人所有，除非事先经云药库或其权利人的合法授权，任何人皆不得擅自以任何形式使用，否则春播云药库可立即终止向用户提供产品和服务，并依法追究其法律责任，赔偿春播云药库一切损失（包括直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失）并消除对春播云药库造成的不良影响。</p>
      </div>
      <div>
        <p class="descrption">五、隐私保护</p>
        <p class="content">（一）您理解并同意，当您在申请成为用户以及在使用服务时，春播云药库不可避免地获悉、收集了您的个人信息，保护您的个人信息是春播云药库的一项基本政策，春播云药库保证不对外公开或向第三方提供用户申请资料及用户在使用服务时存储在春播云药库的个人信息，但下列情况除外：</p>
        <p class="content">1. 事先获得用户的明确授权；</p>
        <p class="content">2. 根据有关的法律法规要求；</p>
        <p class="content">3. 按照相关政府主管部门的要求；</p>
        <p class="content">4. 为维护社会公众的利益；</p>
        <p class="content">5. 向可信赖的合作伙伴披露，让他们根据我们的指示并遵循本协议以及其他任何相应的保密和安全措施来为我们处理这些信息；</p>
        <p class="content">6. 为了提升服务效率、降低服务成本或提高服务质量，我们可能会委托专业服务机构提供协助，因此我们在必要范围内向其提供您的部分信息；</p>
        <p class="content">7. 为维护春播云药库及其关联方的合法权益。</p>
        <p class="content">（二）个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息，在不透露单个用户个人信息资料的前提下，为了给用户提供更好的服务，春播云药库可能会对整个用户数据库进行分析并对用户数据库进行商业上的利用（包括但不限于公布、分析或以其它合法方式使用用户访问量、访问时段、用户偏好等用户数据信息）。</p>
        <p class="content">（三）需要特别说明的是，春播云药库隐私保护政策不适用于其他第三方向您提供的服务，例如春播云药库的卖家依托平台向您提供服务时，您向卖家提供的个人信息不适用春播云药库隐私保护政策，请您特别注意，在使用春播云药库平台服务进行网上交易时，您不可避免地要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或联系地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息尤其是您的账号或密码发生泄露，请您立即联络我们，以便我们根据您的申请采取相应措施。</p>
      </div>
      <div>
        <p class="descrption">六、免责声明</p>
        <p class="content">（一）您理解并同意，春播云药库依照法律规定履行保障基础义务，但对于下述原因导致的合同履行障碍、履行瑕疵、履行延后或履行内容变更等情形，春播云药库并不承担相应的违约责任：</p>
        <p class="content">1. 因自然灾害、罢工、暴乱、战争、政府行为、司法行政命令等不可抗力因素；</p>
        <p class="content">2. 因电力供应故障、通讯网络故障等公共服务因素或第三人因素；</p>
        <p class="content">3. 因常规或紧急的设备与系统维护、设备与系统故障、网络信息与数据安全等因素。</p>
        <p class="content">（二） 如果春播云药库发现用户有下列任一行为的，有权根据相应网络服务的公约或守则的规定，采取相应措施：包括但不限于对该用户帐号的冻结、终止、删除；用户在此承诺春播云药库有权作出上述行为，并承诺不就上述行为要求春播云药库做任何补偿或退费：</p>
        <p class="content">1. 用户提供虚假注册信息；</p>
        <p class="content">2. 用户违反本协议中规定的使用规则；</p>
        <p class="content">3. 通过非法手段、不正当手段或其他不公平的手段使用春播云药库的服务或参与春播云药库活动；</p>
        <p class="content">4. 有损害春播云药库正当利益的行为；</p>
        <p class="content">5. 有严重损害其他用户的行为；</p>
        <p class="content">6. 有违反中华人民共和国的法律、法规的行为或言论；</p>
        <p class="content">7. 有违背社会风俗、社会道德和互联网一般道德和礼仪的行为；</p>
        <p class="content">8. 其他妨碍春播云药库提供服务或春播云药库认为的严重不当行为；</p>
        <p class="content">同一用户若有任一帐号存在上述任一行为的，春播云药库有权对该用户下的所有帐号予以制裁，包括但不限于冻结帐号、删除帐号、终止服务等。</p>
        <p class="content">春播云药库因上述原因删除用户注册的帐号后即不再对用户承担任何义务和责任。</p>
        <p class="content">（三）用户同意保障和维护春播云药库及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给春播云药库或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。</p>
        <p class="content">（四）您了解春播云药库上的信息系商家自行发布，且可能存在风险和瑕疵。春播云药库将通过依照法律规定建立完善相关审核及检查监控制度尽可能保障您在春播云药库的合法权益及良好体验。同时，鉴于信息网络环境下信息与实物相分离的特点，春播云药库无法逐一审查每一笔交易实际上所涉及的实物产品及/或服务，对此您应谨慎判断，如您有任何售后问题或有任何侵权商品的发现，请第一时间联系我们，春播云药库将竭诚保护您的合法权益。</p>
        <p class="content">（五）您理解并同意，在争议调处服务中，春播云药库的客服并非专业人士，仅能以普通人的认知对用户提交的凭证进行判断，春播云药库不保证争议调处决定一定符合您的期望，除法律明确规定及存在故意或重大过失外，春播云药库对争议调处决定不承担责任。</p>
        <p class="content">（五）您理解并同意，在争议调处服务中，春播云药库的客服并非专业人士，仅能以普通人的认知对用户提交的凭证进行判断，春播云药库不保证争议调处决定一定符合您的期望，除法律明确规定及存在故意或重大过失外，春播云药库对争议调处决定不承担责任。</p>
      </div>
      <div>
        <p class="descrption">五、隐私保护</p>
        <p class="content">（一）您理解并同意，当您在申请成为用户以及在使用服务时，春播云药库不可避免地获悉、收集了您的个人信息，保护您的个人信息是春播云药库的一项基本政策，春播云药库保证不对外公开或向第三方提供用户申请资料及用户在使用服务时存储在春播云药库的个人信息，但下列情况除外：</p>
        <p class="content">1. 事先获得用户的明确授权；</p>
        <p class="content">2. 根据有关的法律法规要求；</p>
        <p class="content">3. 按照相关政府主管部门的要求；</p>
        <p class="content">4. 为维护社会公众的利益；</p>
        <p class="content">5. 向可信赖的合作伙伴披露，让他们根据我们的指示并遵循本协议以及其他任何相应的保密和安全措施来为我们处理这些信息；</p>
        <p class="content">6. 为了提升服务效率、降低服务成本或提高服务质量，我们可能会委托专业服务机构提供协助，因此我们在必要范围内向其提供您的部分信息；</p>
        <p class="content">7. 为维护春播云药库及其关联方的合法权益。</p>
        <p class="content">（二）个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息，在不透露单个用户个人信息资料的前提下，为了给用户提供更好的服务，春播云药库可能会对整个用户数据库进行分析并对用户数据库进行商业上的利用（包括但不限于公布、分析或以其它合法方式使用用户访问量、访问时段、用户偏好等用户数据信息）。</p>
        <p class="content">（三）需要特别说明的是，春播云药库隐私保护政策不适用于其他第三方向您提供的服务，例如春播云药库的卖家依托平台向您提供服务时，您向卖家提供的个人信息不适用春播云药库隐私保护政策，请您特别注意，在使用春播云药库平台服务进行网上交易时，您不可避免地要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或联系地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息尤其是您的账号或密码发生泄露，请您立即联络我们，以便我们根据您的申请采取相应措施。</p>
      </div>
      <p class="descrption">七、 修改协议</p>
      <p class="content">（一）根据国家法律法规变化及维护市场秩序、保护用户合法权益等需要，春播云药库将可能不时的修改本协议的有关条款，一旦条款内容发生变动，春播云药库将会在相关的页面提示修改内容。</p>
      <p class="content">（二）如果用户不同意春播云药库修改的内容，有权于变更事项确定的生效日前联系我们反馈意见。如反馈意见得以采纳，我们将酌情调整变更事项。如用户对已生效的变更事项仍不同意的，应当于变更事项确定的生效之日起停止使用春播云药库服务，如果用户在变更事项生效后仍继续使用春播云药库服务，则视为接受条款的变更。</p>
      <p class="descrption">八、法律管辖</p>
      <p class="content">（一）本协议的订立、执行和解释及争议的解决均应适用中华人民共和国大陆地区法律。</p>
      <p class="content">（二）如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，用户和春播云药库一致同意交由湖南春播云药库科技有限公司所在地有管辖权的法院管辖。</p>
      <p class="descrption">九、有效通知</p>
      <p class="content">（一）有效联系方式 </p>
      <p class="content">1. 您在注册成为春播云药库用户，并接受春播云药库服务时，您应该向春播云药库提供真实有效的联系方式（包括您的电子邮件地址、联系电话、联系地址等），对于联系方式发生变更的，您有义务及时更新有关信息，并保持可被有效联系的状态。</p>
      <p class="content"> 2. 春播云药库将向您的上述联系方式的其中之一或其中若干向您送达各类通知，而此类通知的内容可能对您的权利义务产生重大的有利或不利影响，请您务必及时关注。</p>
      <p class="content">3. 您有权通过您注册时填写的手机号码或者电子邮箱获取您感兴趣的产品/服务广告信息、促销优惠等商业性信息；您如果不愿意接收此类信息，您有权通过相应的退订功能进行退订或者直接联系我们。</p>
      <p class="content">（二）送达
      </p>
      <p class="content">本协议履行过程中，我们向您发出的书面通知方式包括但不限于邮寄纸质通知、春播云药库公告、电子邮件、站内信、系统通知、手机短信和传真等方式。如我们以邮寄方式发出通知的，则按照您在春播云药库平台留存的通讯地址交邮后的第三个自然日即视为送达，如以春播云药库公告、电子邮件、系统通知、手机短信和传真等电子方式发出书面通知的，则在通知发送成功即视为送达。

      </p>
      <p class="descrption">《采购功能补充协议》</p>
      <p class="content">
        为促进医药流通发展，降低采购成本,经友好协商，现就用户通过春播云药库平台的采购功能进行采购服务，并对网上交易行为进行管理，达成本协议：
        您已充分理解，采购功能属于B2B采购平台，而并非面向消费者的消费购买市场，仅供具备合法资质的单位使用，同时具备合法资质的单位仅可在其资质许可的且经过审核的范围内使用，当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议的全部内容，并将基于您的真实合法的经营需求而使用采购功能。
      </p>
      <p class="descrption">第一条 商品的订购与评价</p>
      <p class="content">
        1、用户自愿接受本协议和网站相关规定，并按春播云药库规定申请，经春播云药库审核成为春播云药库采购会员后，方可在审核范围内的使用商品采购服务。
      </p>
      <p class="content">2、用户订购商品必须在线交易，春播云药库对于用户任何线下交易与线下协议不承担任何责任。请您特别注意，如在春播云药库网站上以页面标明或其他方式表明相关服务系由第三方提供，您在使用该服务过程中如有疑问或发生纠纷，请您与第三方协商解决。
      </p>
      <p class="content">3、当您在春播云药库平台询价、采购产品及/或服务时，请您务必仔细确认采购产品的品名、价格、数量、型号、规格、尺寸或服务的时间、内容、限制性要求等重要事项，并在采购下单时核实您的联系地址、电话、收货人等信息，在提交订单前，您有权修改上述信息或更正输入错误。作为具备合法资质的单位，您应对自身的药品购销行为负责，应当对您名下的购销人员进行药品相关的法律、法规和专业知识培训，并按规定索取、查验、留存供货企业有关证件、资料、票据。
      </p>
      <p class="content">4、您已充分理解，采购功能属于B2B采购平台，而并非面向消费者的消费购买市场，故您的询价、采购行为应当基于真实的经营需求，不得存在对产品及/或服务实施恶意询价、采购、恶意维权等扰乱春播云药库正常交易秩序的行为。基于维护春播云药库交易秩序及交易安全的需要，春播云药库发现上述情形时可主动执行关闭相关交易订单等操作。
      </p>
      <p class="content">5、您有权在春播云药库提供的评价系统中对与您达成交易的其他用户产品及/或服务进行评价。您的所有评价行为应遵守有关法律法规的规定，评价内容应当客观真实，不应包含任何污言秽语、色情低俗、广告信息及法律法规与本协议列明的其他禁止性信息；您不应以不正当方式帮助他人提升信用或利用评价权利对其他用户实施威胁、敲诈勒索，春播云药库可根据相应管理规定对您实施上述行为所产生的评价信息进行删除或屏蔽。
      </p>
      <p class="content">6、本协议用户订购商品的数量与价格以实际生成的订单为准，生成订单之前用户加入购物车的商品的数量与价格可能随时变化，因此用户应尽快完成订单的支付。用户订单提交后，春播云药库会明确显示付款时限。用户须在规定的时间内付款，否则，供应商有权取消订单，并停止备货。如果用户实际收到的商品数量、规格（以用户签收的单据为准）与订单不一致的，应当与供应商协商处理，协商不成的，由春播云药库负责协调供应商处理。协调不成功的，供应商少发货部分，用户应当提供相应的证据，经春播云药库审核后，春播云药库将相应款项退回用户；供应商多发货或者错发货部分，春播云药库应当要求供应商提供相应证据，同时须将相应的证据提供给用户，并听取用户的说明，经春播云药库判断用户确实多收或者错收的，用户应当按供应商的要求将多收错收部分退回，否则用户须按照签收的单据支付款项。
      </p>
      <p class="content">7、用户必须用通过春播云药库审核的账号进行产品的采购，订单提交、货款支付与结算、确认收货、售后问题处理等工作，使用通过审核的账号进行的操作即视为用户或企业法人授权的行为。
      </p>
      <p class="content">8、春播云药库上展示的商品信息/服务和价格等信息为向您发出的要约，用户生成订单并完成付款一经执行，将视为您与供应商之间就您购买的商品/服务成立了合同关系，供应商在审核无误后即会将订购的商品发出，用户在货物发出后不得无理由进行退换货或拒收货物或更改地址，退换货或拒收货物或更改地址需经供应商或春播云药库同意，否则产生的纠纷及损失由用户承担。如用户采购药品，收货地址应为核准地址。
      </p>
      <p class="content">9、用户理解并同意，根据相关法律法规、经营管理规范、政策的要求，供应商有义务对用户的经营范围、诊疗范围、证明文件进行核实，并有权按照相应的范围进行销售，如供应商根据其质量管理制度拒绝向您发货的，您有权取消订单并办理退款，春播云药库对此不承担任何责任。
      </p>
      <p class="content">10、用户在收到商品的72小时内必须在春播云药库平台确认收货，确认收货时，必须按照有关经营管理规范进行验收入库，认真检查商品外包装是否破损、商品遗失，并根据物流运单认真审核商品件数，当出现意外情况时，必须当场与送货人员进行核实及确定问题原因，并在当日向供应商或春播云药库反馈，明确处理意见。用户未在规定时间内确认收货又未提出异议、或未与送货人员沟通明确问题原因，所产生的纠纷及损失由用户负全责。
      </p>
      <p class="content">11、用户未在规定时间内系统确认又无情况反馈的，春播云药库及供应商视同用户完整无误的收到货物。用户验收不认真，事后提出非质量本身原因的要求，春播云药库不予以接受。
      </p>
      <p class="content">12、用户不得借故不正当或虚假理由，要求退货或取消订单，一经查实，用户应承担因此带来的一切费用和损失。
      </p>
      <p class="content">13、非以下原因，用户不得提出拒收、或退货请求：
      </p>
      <p class="content">（1）未经许可出现的商品或其批号与订单不一致的；
      </p>
      <p class="content">（2）可以证明供应商原因造成商品内、外包装破损、污染的；
      </p>
      <p class="content">（3）可以证明商品存在非用户因素造成的质量问题的；
      </p>
      <p class="content">（4）国家相关部门或用户通知禁止销售、或召回的；
      </p>
      <p class="descrption">第二条 双方权利和义务
      </p>
      <p class="descrption">1、用户权利与义务
      </p>
      <p class="content">（1）作为春播云药库的会员客户，享受春播云药库提供的一站式响应服务。
      </p>
      <p class="content">（2）用户应保证其应具备的合法资质以及必须的授权，并提供相应证明材料，用户资料应符合国家相关法律和规定，并对其真实性、准确性、合法性负全部责任，用户应及时更新相应资质的最新版本；
      </p>
      <p class="content">（3）遵守春播云药库相关规则，认真履行采购商义务，按规定的时间、流程与协议、规则要求开展采购活动，并承担因用户原因造成的迟延交易的责任。
      </p>
      <p class="content">（4）不得超出经营范围采购商品，并按国家规范采购商品并提供相应证明文件；
      </p>
      <p class="content">（5）用户在系统确认收货三日内提供有效货运证明时，春播云药库应协助用户索赔货物运输的损失；
      </p>
      <p class="content">（6）不得盗用他人资质或为他人提供资质证明文件，或者票据等便利条件。
        如用户违反上述承诺，春播云药库有权立即终止所有服务及所有相关协议，并按国家法律法规和平台相关规则追索用户责任。
      </p>
      <p class="descrption">2、春播云药库权利与义务
      </p>
      <p class="content">（1）用户为春播云药库的采购会员，春播云药库应向其提供相应的综合性会员服务。
      </p>
      <p class="content">（2）如行政管理部门等有权机关提出要求的，春播云药库将暂停或终止提供相应服务，且不承担任何责任。
      </p>
      <p class="content">（3）有权对用户的订单数据及交易行为进行监督与管理，用户存在任何问题或怀疑，春播云药库有权向用户发出询问或要求改正的通知，或直接终止本协议；
      </p>
      <p class="descrption">第三条 双方约定
      </p>
      <p class="content">1、用户同意使用用户联系人“手机短信”、“电子邮件”或“春播云药库系统通知”形式接收春播云药库通知，并认可通过上述形式与春播云药库、供应商缔结或达成的相关补充协议。
      </p>
      <p class="content">2、用户在此承诺：用户成为采购会员时即完全同意并接受用户网站相关规则或规定。
      </p>
      <p class="descrption">第四条 违约责任
      </p>
      <p class="content">1、双方承诺严格遵守国家有关法律法规及履行本协议，维护双方权益。
      </p>
      <p class="content">2、您理解并同意，春播云药库依照法律规定履行保障基础义务并尽一切努力保障交易安全，但因下列情况导致用户无法使用平台服务或造成损</p>
      <p class="content">失时，春播云药库不承担除法律有明确规定外的责任：
      </p>
      <p class="content">•平台系统维护或升级；
      </p>
      <p class="content">•平台所依赖的电信设备出现故障或由于战争、骚乱、恐怖主义、自然灾害、国家法律法规或规章变动、网络安全、网络无法覆盖、停电、通信线路被人为破坏等不可抗力因素；
      </p>
      <p class="content">•用户操作不当或通过非法的或非平台认可的方式使用平台服务；
      </p>
      <p class="content">•用户自身的设备、系统、硬件和通信电路、供电线路出现故障；
      </p>
      <p class="content">•因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、银行原因、第三方服务瑕疵或政府行为等原因；
      </p>
      <p class="content">•其他不可归因于我们的原因。
        由于用户自备设备故障或用户失误造成的问题，用户自行承担责任，并赔偿供应方由此遭受的损失。
      </p>
      <p class="content">3、如用户不履行义务时，春播云药库可独立判断并视情况对用户采取警示、账户扣分、限制参加营销活动、中止向用户提供部分或全部服务等处理措施，如用户的行为构成根本违约的，春播云药库可关闭账户，终止本合同。春播云药库有权公告处理结果，且有权根据具体情况是否恢复使用。对于涉嫌违反法律法规、涉嫌违法犯罪的行为将保存有关记录，并依法向有关行政主管部门报告、配合有关行政主管部门调查，并可能依法移送司法机关。如用户的行为使云药库及/或其关联公司遭受损失（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），用户应赔偿云药库及/或其关联公司的上述全部损失。如用户的行为使云药库及/或其关联公司遭受第三人主张权利，云药库及/或其关联公司可在对第三人承担金钱给付等义务后就全部损失向用户追偿。
      </p>
      <p class="content">4、无论本合同其他条款是否有相反约定，春播云药库对用户因本合同项下行为而导致的可得利益损失、商业信誉损失以及数据丢失或损坏等其他损失不承担责任。
      </p>
      <p class="content">5、用户必须严格按照本协议及本网相关规则开展业务活动，认真履行职责，如因用户原因被其它客户投诉，将按照春播云药库相应管理规定承担相应的处罚。
      </p>
      <p class="content">6、如合同不能或者没有必要继续履行的，春播云药库可单方面解除本合同，但应提前5日告知用户。
      </p>
      <p class="descrption">第五条 法律适用和争议解决
      </p>
      <p class="content">1、本合同适用中华人民共和国大陆地区法律。如无相关法律规定的，则应参照商业惯例和（或）行业惯例。
      </p>
      <p class="content">2、本合同引起的任何争议将通过双方友好协商解决，协商不成时，向云药库所在地有管辖权的人民法院提起诉讼。
      </p>
      <p class="content">3、双方因部分条款产生争议的，不影响其他条款的效力，双方将继续履行本合同未涉诉讼的其它部分。
      </p>
      <p class="descrption">第六条 协议生效与其它
      </p>
      <p class="content">1、用户签署或在线接受本协议，本协议即在用户和春播云药库之间产生法律效力。本协议不涉及用户与春播云药库其它用户之间因网上交易而产生的法律关系及法律纠纷。用户理解并同意春播云药库仅作为用户物色交易对象，就产品和服务的交易进行协商，以及获取各类与贸易相关的服务的地点，春播云药库不会参与用户与供应商间的交易，亦不会涉及用户间因交易而产生的法律关系及法律纠纷。如用户在春播云药库平台交易过程中与其他用户/供应商发生争议的，任何一方均有权选择以下途径解决：
      </p>
      <p class="content">（1）与争议相对方自主协商；
      </p>
      <p class="content">（2）通过春播云药库客服进行争议调处；
      </p>
      <p class="content">（3）向有关行政部门投诉；
      </p>
      <p class="content">（4）根据与争议相对方达成的仲裁协议（如有）提请仲裁机构仲裁；
      </p>
      <p class="content">（5）向人民法院提起诉讼。
      </p>
      <p class="content">2、交易期间，春播云药库网站已经发布的或将来发布的各类相关管理办法、规则为协议的组成部分，与协议正文具有同等法律效力。除另有约定外，春播云药库相关管理办法的规定与本协议的约定不一致的，以春播云药库相关管理办法、规则为准。
      </p>
      <p class="content">3、如果本协议的任何条款在任何时候被裁定为无效或不可强制执行，但在根本上不影响协议的效力时，本协议的其它条款应不受影响。本协议的条款标题仅为方便参阅而设，并不以任何方式界定、限制、解释或描述该条款的范围或限度。春播云药库未就您或其他人士的某项违约行为采取行动，并不表明春播云药库撤回就任何继后或类似的违约事件采取动的权利。
      </p>
      <p class="content">4、本协议补充协议是本协议不可分割的组成部分，与协议正文具有同等法律效力。
      </p>
      <p class="content">5、协议终止</p>
      <p class="content">（1）您有权通过以下任一方式终止本协议：
      </p>
      <p class="content">•在满足春播云药库要求的账户注销条件时您自行注销您的账户的；
      </p>
      <p class="content">•变更事项生效前您停止使用春播云药库服务并明示不愿接受变更事项的；
      </p>
      <p class="content">•您明示不愿继续使用春播云药库服务，且符合春播云药库要求的终止条件的。
      </p>
      <p class="content">（2）出现以下情况时，春播云药库可以本协议约定的有效方式通知您终止本协议：
      </p>
      <p class="content">•您的实名认证身份无效、不再合法存续或无法有效核实；
      </p>
      <p class="content">•您的资质过期、失效、被注销等丧失相关资质的情况；
      </p>
      <p class="content">•您违反本协议约定，春播云药库依据违约条款终止本协议的；
      </p>
      <p class="content">•您盗用他人账户、名义或资质、出于非实际经营目采购、为他人提供资质证明文件，或者票据等便利条件；
      </p>
      <p class="content">•除上述情形外，因您违反春播云药库相关使用、管理规定且情节严重，春播云药库依据相关使用、管理规则对您的账户予以关闭的；
      </p>
      <p class="content">•您的账户被春播云药库依据本协议回收的；
      </p>
      <p class="content">•春播云药库基于合理理由相信您的行为可能会使您、春播云药库及春播云药库用户等相关方发生严重损害或产生法律责任；
      </p>
      <p class="content">•其它应当终止服务的情况。
      </p>
      <p class="content">（3）协议终止后的处理：
      </p>
      <p class="content">•本协议终止后，除法律有明确规定外，春播云药库无义务向您或您指定的第三方披露您账户中的任何信息。
      </p>
      <p class="content">•本协议终止后，春播云药库仍享有下列权利：继续保存您留存于春播云药库的各类信息；对于您过往的违约行为，春播云药库可按本协议采取处理措施并公告处理结果，并保留依据本协议进一步向您追究违约责任的权利；对于涉嫌违反法律法规、涉嫌违法犯罪的行为，春播云药库有权保存有关记录，并依法向有关主管行政部门报告、配合有关行政主管部门调查，并可能依法移送司法机关。
      </p>
      <p class="content">•本协议终止后，对于您在本协议存续期间产生的交易订单，春播云药库可通知交易相对方并根据交易相对方的意愿决定是否关闭该等交易订单；如交易相对方要求继续履行的，则您应当就该等交易订单继续履行本协议及交易订单的约定，并承担因此产生的任何损失或增加的任何费用。
      </p>
      <p class="content">6、您与我们仅为独立订约人关系。本协议无意结成或创设任何代理、合伙、合营、雇佣与被雇佣或特许权授予与被授予关系。</p>

    </div>
    <span slot="footer"
          class="dialog-footer">
      <el-button @click="notAgree">不 同 意</el-button>
      <el-button type="primary"
                 @click="agree">同 意</el-button>
    </span>
  </el-dialog>
</template>

<script>
export default {
  data () {
    return {
      dialogShow: false
    }
  },
  methods: {
    agree () {
      // this.rememberAccount = true
      this.$emit('sure', true)
      this.dialogShow = false
    },
    notAgree () {
      // this.rememberAccount = false
      this.$emit('sure', false)
      this.dialogShow = false
    },
    open () {
      this.dialogShow = true
    },
    close () {
      this.dialogShow = false
    },
    // goSubmit() {
    //   this.$emit('sure', this.formTool.desc)
    //   setTimeout(() => {
    //     this.close()
    //   }, 300)
    // }
  }
}
</script>
<style lang='scss' scoped>
::v-deep .el-dialog {
  .el-dialog__body {
    // height: 500px;
    overflow: auto;
    .dialogBox {
      font-size: 18px;
      padding: 10px;
      .title {
        text-align: center;

        font-weight: 600;
      }
      .descrption {
        font-weight: 600;
      }
      // .content {}
    }
  }

  .el-dialog__header {
    border: none;
  }
  .el-dialog__footer {
    border: none;
  }
}
</style>
